{"trailId":"trail-givat-yoav-nator","name":"Givat Yoav – Nator Trail","description":"The Golan Trail is a roughly 120 km running route, way-marked in three colors: blue around the Sea of Galilee, white on Mount Hermon, and green across the Golan Heights. It begins at Hermon in the north and ends in the Mabua Hama Forest—overlooking the Sea of Galilee—in the south. The trail is divided into 13 segments of 6–12 km each.\n\nThe section described here links segments 12 and 11 and is typically run from south to north (though you can also do it north to south). It starts in the Givat Yoav Grove and finishes at Umm el-Kanatir (Ein Qashati), just outside Natur. Along the way you’ll enjoy panoramic views of both the Galilee and the Golan, encounter archaeological remains and natural springs, pass near Bir esh-Shaghur, cross the Samakh Stream, and skirt natural pools where the Samakh meets Nahal El Al.\n\nTwo points of interest:\n\nEin Qashati (Umm el-Kanatir)\nAn ancient Jewish village on the east bank of the Samakh Stream. Its Arabic name means “Mother of the Arches,” after the three stone arches that once spanned the spring (only one survives intact from the Mishnaic–Talmudic era). The remains of a large synagogue wall stand prominently in the village center—among the most impressive and best-preserved synagogue structures in Israel.\n\nBir esh-Shaghur\nPerched on the western slopes of the Golan Heights with a view over the Sea of Galilee, this was established in the late 19th century as a Jewish-agricultural settlement. Its ruins are still visible on site today.","media":[{"id":"media-001","type":"image","url":"https://static.wixstatic.com/media/c73128_44dddb001a4b4bc1b16ad7ce7c0e76ad~mv2.jpg","description":"Starting point: Givat Yoav Grove. You can park your car here. Since this is a one-way route, you must leave a vehicle at the finish point. Don’t forget the key."},{"id":"media-002","type":"image","url":"https://static.wixstatic.com/media/c73128_94111ae6cbc9496ba42e9f30937e2394~mv2.jpg","description":"Keren Engev is the cone-shaped hill on the left side."},{"id":"media-003","type":"video","url":"https://video.wixstatic.com/video/c73128_a4eb4059ef9e4518bb331e8f5093176d/1080p/mp4/file.mp4","description":""},{"id":"media-004","type":"image","url":"https://static.wixstatic.com/media/c73128_062175078e814b70bcd93356c4c09f07~mv2.jpg","description":""},{"id":"media-005","type":"video","url":"https://video.wixstatic.com/video/c73128_c4742c9fb42541cbbb9ea2517f09a607/1080p/mp4/file.mp4","description":"Mount Tavor – the round-shaped mountain."},{"id":"media-006","type":"video","url":"https://video.wixstatic.com/video/c73128_4554ece55f8549a0a8ad4005298a4bd4/1080p/mp4/file.mp4","description":"You ran along the Samech River (on the left side, north)."},{"id":"media-007","type":"image","url":"https://static.wixstatic.com/media/c73128_c3b29a4ae7d54dc4a613f7c160772c9b~mv2.jpeg","description":"From the Samakh streambed and its junction with the El-Al stream, you begin climbing toward Nator and Umm el-Qanṭir. Some of the ascents are quite steep, so you may prefer to walk until you reach the Syrian Water Diversion Line. From there, the way to Umm el-Qanṭir and the cars is short."},{"id":"media-008","type":"image","url":"https://static.wixstatic.com/media/c73128_5b9ae518d61049eb9bdde9ff4fe7a712~mv2.jpeg","description":"End point: This is the final stop, the parking area near the official archaeological site. You can leave your car here. If you have the time and energy, it's definitely worth visiting the archaeological site of Um El Kantir."},{"id":"media-009","type":"video","url":"https://video.wixstatic.com/video/c73128_f9270759dc7a4e99a116c2ec8a03e51b/1080p/mp4/file.mp4","description":"This is the 3D trail."}]}