{
    "trailId": "Horashim Forest",
    "name": "Horashim Forest",
    "description": "Horshim Forest lies on the seam between the Coastal Plain and the Dume Shomron—the western ridge of the Samarian Hills—where the mountainous terrain gradually descends toward the plains.\nThe forest borders Kibbutz Horshim, Moshav Yarkhiv, Oranit, Kfar Bara, and Nirit, and is easily accessible via fast and convenient routes from all directions.\n\nThe forest offers a diverse running experience, combining shaded trails through natural woodland with open views of the Samaria region, the Sharon plain, and the Greater Tel Aviv area. In winter and spring, you'll enjoy abundant blossoms and lush vegetation; in summer, the shaded areas allow for pleasant early morning runs.\n\nHorshim Forest is known for its well-maintained trails that remain firm even after rainfall, making it an ideal year-round running destination.\n\nAt the heart of the forest flows Nahal Kana—a seasonal stream that flows only during the rainy season. It is one of the tributaries of the Yarkon River and crosses the forest from east to west.\n\nThe recommended trail is easy to navigate, includes a few moderate ascents, and is suitable for runners of all levels. KKL signage helps with orientation and greatly reduces the chance of getting off track.\n\nThe forest is also a favorite among cyclists, with trails available in various levels of difficulty.\n\n🅿️ Access and Entrances:\nThere are two main entrances to the forest. The trail description is based on starting from Nirit:\n\nNirit Entrance – through the gate of the community. The gate opens at 06:00, but it’s possible to begin your run from the gate even earlier if you arrive before it opens.\n\nKibbutz Horshim Entrance – open throughout the day and a convenient alternative for those arriving before the Nirit gate opens.\n\n🚗 Directions:\n\nTo Hezi Sapir Parking Lot (Nirit): Drive along the access road to Nirit. Continue about 700 meters from the entrance gate—the parking lot will be on the right. (Waze: חניון חזי ספיר)\n\nTo the Main Entrance (Horshim): From Horshim Interchange, head east on Road 5233 to the entrance of Kibbutz Horshim. Just before the gate, turn left (north) and continue for about 750 meters to the main forest entrance. (Waze: יער חורשים)\n\nLet me know if you'd like a shorter version for a brochure, or a more casual tone for a blog or social media.",
    "media": [
        {
            "id": "media-001",
            "type": "video",
            "url": "https://video.wixstatic.com/video/c73128_53ae18839fea48f6b10924bf0c36f877/720p/mp4/file.mp4",
            "description": ""
        },
        {
            "id": "media-002",
            "type": "image",
            "url": "https://static.wixstatic.com/media/c73128_57cb401ae7564dfc90d1b5bfc7663ff1~mv2.jpg",
            "description": ""
        },
        {
            "id": "media-003",
            "type": "image",
            "url": "https://static.wixstatic.com/media/c73128_37f225cc689b4c1084e030e36c1602e2~mv2.jpg",
            "description": ""
        },
        {
            "id": "media-004",
            "type": "image",
            "url": "https://static.wixstatic.com/media/c73128_2800b29039a14ee0a87694447d18a50d~mv2.jpg",
            "description": "After 150 meters, you’ll reach Mitzpe Hezi — a scenic lookout facing east, offering views of the Samarian Hills, Shaarei Tikva, Ariel, Azzun Atma, and other nearby communities. Just a few steps further, turning westward, you'll enjoy a panoramic view of the Coastal Plain, the Tel Aviv metropolitan area (Gush Dan), and the cities of the Sharon region."
        },
        {
            "id": "media-005",
            "type": "image",
            "url": "https://static.wixstatic.com/media/c73128_4655f92718944a37b86fc615e661daf4~mv2.jpg",
            "description": "Continue running and, after a few meters, keep to the left. Run for a few dozen more meters until you reach the sign for “Snake Stairs.” Turn left at the sign and descend along the path until it meets the white road that runs alongside a fence. Turn left again and run for a few dozen meters until you reach a gate in the fence."
        },
        {
            "id": "media-006",
            "type": "image",
            "url": "https://static.wixstatic.com/media/c73128_6fb9733d57324341b36a4f0410b2f768~mv2.jpg",
            "description": ""
        },
        {
            "id": "media-007",
            "type": "image",
            "url": "https://static.wixstatic.com/media/c73128_3265960317ab49d789128b58b8e41f6c~mv2.jpg",
            "description": "The gate is open — go through it and descend along the path for about 120 meters until you reach a white dirt road. Turn left and continue running downhill for about 650 meters. The road curves, and soon you'll reach a junction."
        },
        {
            "id": "media-008",
            "type": "image",
            "url": "https://static.wixstatic.com/media/c73128_9e228bc4e2ef46fe976dc935e27e786d~mv2.jpg",
            "description": "At the junction, turn left and continue running straight along the path."
        },
        {
            "id": "media-009",
            "type": "image",
            "url": "https://static.wixstatic.com/media/c73128_dd8116ae03e9424e80832a9ef9dbf613~mv2.jpg",
            "description": "At the next junction, after a few dozen meters, turn right."
        },
        {
            "id": "media-010",
            "type": "image",
            "url": "https://static.wixstatic.com/media/c73128_e9b02545ac7d401492f5343bead17419~mv2.jpg",
            "description": "After about 100 meters, there is an uphill turn to the left. Turn left and run for approximately 550 meters until you reach a junction. Turn right there and begin circling the hill. On your right, you'll see the path you came from"
        },
        {
            "id": "media-011",
            "type": "image",
            "url": "https://static.wixstatic.com/media/c73128_90fb6b9abb174f46996a77b1fa17f02d~mv2.jpg",
            "description": "After approximately 650 meters, there will be a left turn leading uphill"
        },
        {
            "id": "media-012",
            "type": "image",
            "url": "https://static.wixstatic.com/media/c73128_fb6dd340dc9a4bd2b2fa7db5f7ffb46e~mv2.jpg",
            "description": "After approximately 270 meters, turn right and continue running downhill for about 400 meters. The path will curve to the left and lead to a wide white dirt road."
        },
        {
            "id": "media-013",
            "type": "image",
            "url": "https://static.wixstatic.com/media/c73128_1f6d389a690d41b59cbfbc2f79f370aa~mv2.jpg",
            "description": "Turn right (note: there's another path slightly before—don’t get confused), and continue for about 880 meters in the direction of Horshim."
        },
        {
            "id": "media-014",
            "type": "image",
            "url": "https://static.wixstatic.com/media/c73128_22c9f253250542ffa47ea2c0eb875385~mv2.jpg",
            "description": ""
        },
        {
            "id": "media-015",
            "type": "image",
            "url": "https://static.wixstatic.com/media/c73128_63aadf2e151a4718874de42276500acf~mv2.jpg",
            "description": "As the path curves to the left, you’ll see several cypress trees. Turn right onto the bike trail and begin descending. You are now near Kibbutz Horshim, and the paths will lead you back to the parking area."
        },
        {
            "id": "media-016",
            "type": "image",
            "url": "https://static.wixstatic.com/media/c73128_6885930d28a84a998b7bf88f09f03092~mv2.jpg",
            "description": ""
        },
        {
            "id": "media-017",
            "type": "image",
            "url": "https://static.wixstatic.com/media/c73128_25b1b19161864640a2368ceadcebbdba~mv2.jpg",
            "description": "Continue running downhill for about 400 meters along the bike trail. After approximately 150 meters, you’ll reach a trail junction — turn right and then immediately left. Continue along the path until you reach the fence of Kibbutz Horshim. Turn right there and run along the fence toward the parking lot. Inside the parking area, turn left and continue until you reach the Nahal Kana streambed."
        },
        {
            "id": "media-018",
            "type": "image",
            "url": "https://static.wixstatic.com/media/c73128_3cde0787c3fa4144a48fe68075bb51e5~mv2.jpg",
            "description": "\nCross the stream and continue running west along the dirt road. On your right, you'll pass an avocado grove, and on your left, Nahal Kana will flow alongside you. Run for about 700 meters until you reach an olive grove — there, turn right."
        },
        {
            "id": "media-019",
            "type": "image",
            "url": "https://static.wixstatic.com/media/c73128_1eac095de6d3435186818f8b571c5ed1~mv2.jpg",
            "description": ""
        },
        {
            "id": "media-020",
            "type": "image",
            "url": "https://static.wixstatic.com/media/c73128_cb32ec3be53b425295fe73ade9e1c1d6~mv2.jpg",
            "description": ""
        },
        {
            "id": "media-021",
            "type": "image",
            "url": "https://static.wixstatic.com/media/c73128_949fd115b0084b8abe89747c2c563681~mv2.jpg",
            "description": "\nContinue running for approximately 450 meters. The olive grove on your left will disappear, and an avocado grove will appear on your right. Continue until you reach a right turn — take it."
        },
        {
            "id": "media-022",
            "type": "image",
            "url": "https://static.wixstatic.com/media/c73128_04d6dea632e04b879fb022622b9c114e~mv2.jpg",
            "description": "\nAfter about 150 meters uphill, turn left and continue running uphill for another 300 meters. At the junction, turn right and immediately left. Run another 300 meters until you reach the next junction, where you should turn right. You are now at a high point with an open view above the treetops. From here, continue straight toward the Hezi parking lot — you’ll need to pass through a gate in the fence once again."
        },
        {
            "id": "media-023",
            "type": "video",
            "url": "https://video.wixstatic.com/video/c73128_dfdb42ebb2084498a7f9fe801ab7b524/1080p/mp4/file.mp4",
            "description": ""
        }
    ]
}