{
    "trailId": "Snir and Hermon Rivers circular",
    "name": "Snir and Hermon Rivers circular",
    "description": "One of the most beautiful and unique routes in northern Israel, this flat circular trail winds through the heart of the Hula Valley, passing by the picturesque kibbutzim and moshavim of Sde Nehemia, Beit Hillel, HaGoshrim, and She’ar Yashuv.\n\nThe trail can be run in either direction and offers multiple convenient starting points: Eucalyptus Parking Lot, Beit Hillel, Hurshat Tal, HaGoshrim, the Hermon Stream Nature Reserve (Banias) near She’ar Yashuv, Shaked Parking Lot, and more.\n\nThis description begins at a bridge crossing the Jordan River and continues along a charming path from Sde Nehemia, following the Snir Stream. Along the way, you’ll run beside clear flowing water, lush trees, pecan orchards, and breathtaking views in every direction. The trail offers stunning vistas of Mount Hermon, the Golan Heights, and the Ramim Ridge—a powerful blend of flowing water, dramatic mountain scenery, and the rural tranquility that defines the Upper Galilee.\n\nYou’ll encounter countless scenic spots, especially near the streams, but also through open fields. Most of the trail is shaded, easy to navigate, and has no significant climbs. While some sections are paved, the majority is on pleasant off-road terrain.\n\n⚠️ Please be cautious when crossing roads near She’ar Yashuv and exiting Beit Hillel.\n\nThis trail is suitable for running year-round, including summer. The photos were taken in late July after a dry year—expect muddy conditions in winter.",
    "media": [
        {
            "id": "media-001",
            "type": "video",
            "url": "https://video.wixstatic.com/video/c73128_848207c58b604a1c8d31b18a48c71155/720p/mp4/file.mp4",
            "description": ""
        },
        {
            "id": "media-002",
            "type": "image",
            "url": "https://static.wixstatic.com/media/c73128_ad526c0de3ac4a4a80412ffa4a662d2d~mv2.jpg",
            "description": "The route begins at the parking lot at the entrance to Kibbutz Sde Nehemia. From there, run toward the yellow gate and turn left onto the bridge that crosses the Jordan River."
        },
        {
            "id": "media-003",
            "type": "image",
            "url": "https://static.wixstatic.com/media/c73128_272b771ae3a346879b25275eff81d25b~mv2.jpg",
            "description": ""
        },
        {
            "id": "media-004",
            "type": "image",
            "url": "https://static.wixstatic.com/media/c73128_b264c4c453b04e4ba2a6aedb71281aae~mv2.jpg",
            "description": "From the bridge, we get a first taste of the scenery that will accompany us along significant parts of the route."
        },
        {
            "id": "media-005",
            "type": "image",
            "url": "https://static.wixstatic.com/media/c73128_f2d794ee4c5241c5b523838eca15ff62~mv2.jpg",
            "description": "After crossing the bridge, turn right and run along the Snir Stream (Hasbani) for approximately 4.5 km, until you pass the village of Beit Hillel.\nThis section of the route runs alongside flowing streams, green trees, and open fields, making it one of the most scenic and pleasant parts of the trail.\nThe path includes both paved segments and dirt roads, and it is well-marked, so navigation is easy and straightforward."
        },
        {
            "id": "media-006",
            "type": "image",
            "url": "https://static.wixstatic.com/media/c73128_95db2c92bd6241fab22a9d481f1cc947~mv2.jpg",
            "description": ""
        },
        {
            "id": "media-007",
            "type": "image",
            "url": "https://static.wixstatic.com/media/c73128_207e971f0ce442e7b04c7796c56a89b9~mv2.jpg",
            "description": ""
        },
        {
            "id": "media-008",
            "type": "image",
            "url": "https://static.wixstatic.com/media/c73128_35d6ec936bce47759c8846b174b6660d~mv2.jpg",
            "description": ""
        },
        {
            "id": "media-08",
            "type": "image",
            "url": "https://static.wixstatic.com/media/c73128_8a5d459720cf43cba318d50068920795~mv2.jpg",
            "description": ""
        },
        {
            "id": "media-010",
            "type": "image",
            "url": "https://static.wixstatic.com/media/c73128_c79462b251e24467b2dbb38b946c6a5d~mv2.jpg",
            "description": "When you reach the Green Camping parking area—located at the northern entrance to Beit Hillel—run about 30 meters along the road, then turn right through a gate to bypass the campground from the east."
        },
        {
            "id": "media-011",
            "type": "image",
            "url": "https://static.wixstatic.com/media/c73128_1b08fef99b404ed0b76c561a54896140~mv2.jpg",
            "description": "Run carefully along the road until you reach a right turn onto a dirt path. You'll need to pass through a gate, with the grove located to your right."
        },
        {
            "id": "media-012",
            "type": "image",
            "url": "https://static.wixstatic.com/media/c73128_4325a730e67a4522a05abbbca78ed708~mv2.jpg",
            "description": "Run for about 600 meters until you reach the confluence of the Hasbani and Snir streams. On your right, you'll see the shopping area at the entrance to Kibbutz HaGoshrim."
        },
        {
            "id": "media-013",
            "type": "image",
            "url": "https://static.wixstatic.com/media/c73128_86437cd8fea343c7b7c8de4c5ab4adf4~mv2.jpg",
            "description": ""
        },
        {
            "id": "media-014",
            "type": "image",
            "url": "https://static.wixstatic.com/media/c73128_6898b880528c4c95be8fcc90ca3c4b9f~mv2.jpg",
            "description": "Run carefully underneath the road, then continue onto the blue metal bridge."
        },
        {
            "id": "media-015",
            "type": "image",
            "url": "https://static.wixstatic.com/media/c73128_8a9bfc7e81934eb9a1d46551635b9e74~mv2.jpg",
            "description": ""
        },
        {
            "id": "media-016",
            "type": "image",
            "url": "https://static.wixstatic.com/media/c73128_437e8ef7b82642b6b54bf03f8b355516~mv2.jpg",
            "description": ""
        },
        {
            "id": "media-017",
            "type": "image",
            "url": "https://static.wixstatic.com/media/c73128_22fdeb2725584757aaad6ac08ef6338c~mv2.jpg",
            "description": "un along the promenade leading to Kibbutz Dafna – a route approximately 1.7 km long. In front of you, the majestic Hermon and Golan mountains will rise, offering a stunning view throughout the way. On your right, you’ll pass Kibbutz HaGoshrim, and later continue past the Hurshat Tal nature reserve.\nAs Hurshat Tal ends and before reaching Kibbutz Dafna, leave the promenade, cross the road heading south, and continue running along the promenade on the eastern side of the road – with the village of She’ar Yashuv on your left and Hurshat Tal on your right"
        },
        {
            "id": "media-018",
            "type": "image",
            "url": "https://static.wixstatic.com/media/c73128_793312b39b1542b1a93b65a7c4855098~mv2.jpg",
            "description": ""
        },
        {
            "id": "19",
            "type": "image",
            "url": "https://static.wixstatic.com/media/c73128_6f686e9deacb48a5b95e19e3b7ba95ed~mv2.jpg",
            "description": "carefully cross the road heading south, and continue running along the promenade on the eastern side of the road"
        },
        {
            "id": "20",
            "type": "image",
            "url": "https://static.wixstatic.com/media/c73128_12a8c2f867f34633bcd5869f55ce1a2b~mv2.jpg",
            "description": ""
        },
        {
            "id": "21",
            "type": "image",
            "url": "https://static.wixstatic.com/media/c73128_3ece9f3209bc4ac8b898e68ea640c5a5~mv2.jpg",
            "description": "Run for about 1.3 km, and approximately 150 meters after the turnoff to She’ar Yashuv – just after the Hermon Stream (Banias) crosses the road – carefully cross the road to a dirt path. From there, begin running along the Hermon Stream, surrounded by trees and natural vegetation. There are several access points to the stream along the way, and the sound of flowing water accompanies you throughout – a refreshing and peaceful nature experience."
        },
        {
            "id": "22",
            "type": "image",
            "url": "https://static.wixstatic.com/media/c73128_057b835ea0a44d7dae8599db40c18467~mv2.jpg",
            "description": ""
        },
        {
            "id": "23",
            "type": "image",
            "url": "https://static.wixstatic.com/media/c73128_267c86fc31a24b9badc485960418193c~mv2.jpg",
            "description": ""
        },
        {
            "id": "24",
            "type": "image",
            "url": "https://static.wixstatic.com/media/c73128_7c90c2699c3d43f3ae60fb75795c19ee~mv2.jpg",
            "description": "After about one kilometer of running, you’ll reach the Israel National Trail, marked with orange, blue, and white stripes.Continue running for about 3.2 km along the Hermon Stream, following the Israel National Trail on a path known as Derech HaTzafzafot (“Poplar Way”). The trail is shaded by trees and surrounded by lush vegetation, with the sound of flowing water accompanying you throughout.\nThe route passes through pleasant day-use areas such as Shaked Parking Area, Dekel Parking Area, Poplar Trail, and Poplar Grove.\nAfter approximately 3.2 km, you’ll reach the entrance gate to Kibbutz Sde Nehemia."
        },
        {
            "id": "25",
            "type": "image",
            "url": "https://static.wixstatic.com/media/c73128_275eb4a85c874cd999e5c7a32070d835~mv2.jpg",
            "description": ""
        },
        {
            "id": "26",
            "type": "image",
            "url": "https://static.wixstatic.com/media/c73128_fdab0b3d77474e288741311859824594~mv2.jpg",
            "description": ""
        },
        {
            "id": "27",
            "type": "image",
            "url": "https://static.wixstatic.com/media/c73128_40bbeb47bf7b498b9d2129eefde2a66e~mv2.jpg",
            "description": ""
        },
        {
            "id": "28",
            "type": "image",
            "url": "https://static.wixstatic.com/media/c73128_8074f27742154352af57c2504ff813d1~mv2.jpg",
            "description": "Go around the gate on the right, and continue running for about 850 meters along the Hermon Stream. The path remains shaded and pleasant, with the sound of flowing water and lush vegetation all around. The houses of the kibbutz will be on your left as you run.\nAt the end of this section, you’ll reach a bridge, and from there continue directly to the parking area."
        },
        {
            "id": "29",
            "type": "image",
            "url": "https://static.wixstatic.com/media/c73128_6b1d5f611aac419996ca09a256c45caa~mv2.jpg",
            "description": ""
        },
        {
            "id": "media-30",
            "type": "video",
            "url": "https://video.wixstatic.com/video/c73128_6b0eba45ba6144bd914166e38894b8f0/1080p/mp4/file.mp4",
            "description": ""
        }
    ]
}